# Data Wrangling & Consistency Checks
## Importing libraries
## Clean data
### - import datas
### - data wrangling
### - data consistency checks
## Export data

### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

### Importing employee data

In [3]:
path = r'/Users/rusamijan/06-2023 Chinook Music Store Analysis'

In [4]:
df_emp = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'employee.csv'), index_col = False)

### Data wrangling for employee

In [5]:
df_emp.head()

,employee_id,last_name,first_name,title,reports_to,birthdate,hire_date,address,city,state,country,postal_code,phone,fax,email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2016-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2016-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2017-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2017-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2017-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [15]:
df_emp.shape

(8, 15)

In [7]:
df_emp.describe()

       employee_id  reports_to
count      8.00000    7.000000
mean       4.50000    2.857143
std        2.44949    2.193063
min        1.00000    1.000000
25%        2.75000    1.500000
50%        4.50000    2.000000
75%        6.25000    4.000000
max        8.00000    6.000000

In [9]:
df_emp['title'].value_counts()

Sales Support Agent    3
IT Staff               2
General Manager        1
Sales Manager          1
IT Manager             1
Name: title, dtype: int64

In [10]:
df_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  8 non-null      int64
 1   last_name    8 non-null      object
 2   first_name   8 non-null      object
 3   title        8 non-null      object
 4   reports_to   7 non-null      float64
 5   birthdate    8 non-null      object
 6   hire_date    8 non-null      object
 7   address      8 non-null      object
 8   city         8 non-null      object
 9   state        8 non-null      object
 10  country      8 non-null      object
 11  postal_code  8 non-null      object
 12  phone        8 non-null      object
 13  fax          8 non-null      object
 14  email        8 non-null      object
dtypes: float64(1), int64(1), object(13)
memory usage: 1.1+ KB

### Data consistency checks

In [14]:
#Fnding null value 
df_emp.isnull().sum()

employee_id    0
last_name      0
first_name     0
title          0
reports_to     1
birthdate      0
hire_date      0
address        0
city           0
state          0
country        0
postal_code    0
phone          0
fax            0
email          0
dtype: int64

only 1 missing value at report_to column. No need to do anything

In [16]:
#Finding duplicate value
df_dups_emp = df_emp[df_emp.duplicated()]

In [17]:
df_dups_emp

Empty DataFrame
Columns: [employee_id, last_name, first_name, title, reports_to, birthdate, hire_date, address, city, state, country, postal_code, phone, fax, email]
Index: []

The result has no duplicate value in employee table

In [18]:
#Check employee for mixed types
for col in df_emp.columns.tolist():
  weird = (df_emp[[col]].applymap(type) != df_emp[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_emp[weird]) > 0:
    print (col)

In [19]:
#Print "consistent" if no mixed types
for col in df_emp.columns.tolist():
  weird = (df_emp[[col]].applymap(type) != df_emp[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_emp[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

employee_id  consistent
last_name  consistent
first_name  consistent
title  consistent
reports_to  consistent
birthdate  consistent
hire_date  consistent
address  consistent
city  consistent
state  consistent
country  consistent
postal_code  consistent
phone  consistent
fax  consistent
email  consistent

The result shows no mix type of data and consistency

### Importing customer, invoice, invoice_line, track

In [74]:
df_cus = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customer.csv'), index_col = False)
df_inv = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'invoice.csv'), index_col = False)
df_invl = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'invoice_line.csv'), index_col = False)
df_tr = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'track.csv'), index_col = False)

### Data wrangling for customer

In [33]:
df_cus.head()

,customer_id,first_name,last_name,company,address,city,state,country,postal_code,phone,fax,email,support_rep_id
0,1,LuÌs,GonÁalves,Embraer - Empresa Brasileira de Aeron·utica S.A.,"Av. Brigadeiro Faria Lima, 2170",S?o JosÈ dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Kˆhler,NaN,Theodor-Heuss-Straﬂe 34,Stuttgart,NaN,Germany,70174,+49 0711 2842222,NaN,leonekohler@surfeu.de,5
2,3,FranÁois,Tremblay,NaN,1498 rue BÈlanger,MontrÈal,QC,Canada,H2G 1A7,+1 (514) 721-4711,NaN,ftremblay@gmail.com,3
3,4,Bj¯rn,Hansen,NaN,UllevÂlsveien 14,Oslo,NaN,Norway,171,+47 22 44 22 22,NaN,bjorn.hansen@yahoo.no,4
4,5,Franti?ek,Wichterlov·,JetBrains s.r.o.,Klanova 9/506,Prague,NaN,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [34]:
df_cus.shape

(59, 13)

In [35]:
df_cus.describe()

       customer_id  support_rep_id
count    59.000000       59.000000
mean     30.000000        3.949153
std      17.175564        0.818403
min       1.000000        3.000000
25%      15.500000        3.000000
50%      30.000000        4.000000
75%      44.500000        5.000000
max      59.000000        5.000000

In [36]:
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     59 non-null     int64
 1   first_name      59 non-null     object
 2   last_name       59 non-null     object
 3   company         10 non-null     object
 4   address         59 non-null     object
 5   city            59 non-null     object
 6   state           30 non-null     object
 7   country         59 non-null     object
 8   postal_code     55 non-null     object
 9   phone           58 non-null     object
 10  fax             12 non-null     object
 11  email           59 non-null     object
 12  support_rep_id  59 non-null     int64
dtypes: int64(2), object(11)
memory usage: 6.1+ KB

### Data consistency checks

In [38]:
#Fnding null value 
df_cus.isnull().sum()

customer_id        0
first_name         0
last_name          0
company           49
address            0
city               0
state             29
country            0
postal_code        4
phone              1
fax               47
email              0
support_rep_id     0
dtype: int64

In [39]:
#check nan value in company
df_nan = df_cus[df_cus['company'].isnull() == True]

df_nan

In [41]:
#check nan value in fax
df_nan1 = df_cus[df_cus['fax'].isnull() == True]

df_nan1

In [43]:
#check nan value in state
df_nan2 = df_cus[df_cus['state'].isnull() == True]

df_nan2

We have 59 rows in customer table and those nan values in fax, state and company columns are more than half of overall data so we can't remove because it won't be enough data for our analysis

In [45]:
#Finding duplicate value
df_dup_cus = df_cus[df_cus.duplicated()]

In [46]:
df_dup_cus

Empty DataFrame
Columns: [customer_id, first_name, last_name, company, address, city, state, country, postal_code, phone, fax, email, support_rep_id]
Index: []

There is no duplicate value

In [47]:
#Check customer for mixed types
for col in df_cus.columns.tolist():
  weird = (df_cus[[col]].applymap(type) != df_cus[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cus[weird]) > 0:
    print (col)

company
state
postal_code
phone
fax

In [48]:
#Print "consistent" if no mixed types
for col in df_cus.columns.tolist():
  weird = (df_cus[[col]].applymap(type) != df_cus[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cus[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

customer_id  consistent
first_name  consistent
last_name  consistent
company  mixed
address  consistent
city  consistent
state  mixed
country  consistent
postal_code  mixed
phone  mixed
fax  mixed
email  consistent
support_rep_id  consistent

In [59]:
df_cus.dtypes

customer_id        int64
first_name        object
last_name         object
company           object
address           object
city              object
state             object
country           object
postal_code       object
phone             object
fax               object
email             object
support_rep_id     int64
dtype: object

In [65]:
df_cus['company'] = df_cus['company'].astype(str)
df_cus['state'] = df_cus['state'].astype(str)
df_cus['fax'] = df_cus['fax'].astype(str)
df_cus['phone'] = df_cus['phone'].astype(str)
df_cus['postal_code'] = df_cus['postal_code'].astype(str)

In [66]:
#Print "consistent" if no mixed types
for col in df_cus.columns.tolist():
  weird = (df_cus[[col]].applymap(type) != df_cus[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cus[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

customer_id  consistent
first_name  consistent
last_name  consistent
company  consistent
address  consistent
city  consistent
state  consistent
country  consistent
postal_code  consistent
phone  consistent
fax  consistent
email  consistent
support_rep_id  consistent

In [67]:
df_cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     59 non-null     int64
 1   first_name      59 non-null     object
 2   last_name       59 non-null     object
 3   company         59 non-null     object
 4   address         59 non-null     object
 5   city            59 non-null     object
 6   state           59 non-null     object
 7   country         59 non-null     object
 8   postal_code     59 non-null     object
 9   phone           59 non-null     object
 10  fax             59 non-null     object
 11  email           59 non-null     object
 12  support_rep_id  59 non-null     int64
dtypes: int64(2), object(11)
memory usage: 6.1+ KB

### Data wrangling for invoice

In [75]:
df_inv.head()

,invoice_id,customer_id,invoice_date,billing_address,billing_city,billing_state,billing_country,billing_postal_code,total
0,1,18,1/3/17 0:00,627 Broadway,New York,NY,USA,10012-2612,15.84
1,2,30,1/3/17 0:00,230 Elgin Street,Ottawa,ON,Canada,K2P 1L7,9.90
2,3,40,1/5/17 0:00,"8, Rue Hanovre",Paris,None,France,75002,1.98
3,4,18,1/6/17 0:00,627 Broadway,New York,NY,USA,10012-2612,7.92
4,5,27,1/7/17 0:00,1033 N Park Ave,Tucson,AZ,USA,85719,16.83

In [76]:
df_inv.shape

(614, 9)

In [77]:
df_inv.describe()

       invoice_id  customer_id       total
count  614.000000   614.000000  614.000000
mean   307.500000    29.517915    7.670081
std    177.390811    17.095991    4.218043
min      1.000000     1.000000    0.990000
25%    154.250000    14.000000    3.960000
50%    307.500000    30.000000    7.920000
75%    460.750000    44.000000    9.900000
max    614.000000    59.000000   23.760000

In [78]:
df_inv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   invoice_id           614 non-null    int64
 1   customer_id          614 non-null    int64
 2   invoice_date         614 non-null    object
 3   billing_address      614 non-null    object
 4   billing_city         614 non-null    object
 5   billing_state        614 non-null    object
 6   billing_country      614 non-null    object
 7   billing_postal_code  614 non-null    object
 8   total                614 non-null    float64
dtypes: float64(1), int64(2), object(6)
memory usage: 43.3+ KB

### Data consistency checks

In [79]:
#Fnding null value
df_inv.isnull().sum()

invoice_id             0
customer_id            0
invoice_date           0
billing_address        0
billing_city           0
billing_state          0
billing_country        0
billing_postal_code    0
total                  0
dtype: int64

no missing value

In [81]:
#Finding duplicate value
df_dup_inv = df_inv[df_inv.duplicated()]

In [82]:
df_dup_inv

Empty DataFrame
Columns: [invoice_id, customer_id, invoice_date, billing_address, billing_city, billing_state, billing_country, billing_postal_code, total]
Index: []

no duplicate value

In [83]:
#Check customer for mixed types
for col in df_inv.columns.tolist():
  weird = (df_inv[[col]].applymap(type) != df_inv[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_inv[weird]) > 0:
    print (col)

In [84]:
#Print "consistent" if no mixed types
for col in df_inv.columns.tolist():
  weird = (df_inv[[col]].applymap(type) != df_inv[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_inv[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

invoice_id  consistent
customer_id  consistent
invoice_date  consistent
billing_address  consistent
billing_city  consistent
billing_state  consistent
billing_country  consistent
billing_postal_code  consistent
total  consistent

In [ ]:
### Data wrangling for invoice_line

In [86]:
df_invl.head()

   invoice_line_id  invoice_id  track_id  unit_price  quantity
0                1           1      1158        0.99         1
1                2           1      1159        0.99         1
2                3           1      1160        0.99         1
3                4           1      1161        0.99         1
4                5           1      1162        0.99         1

In [87]:
df_invl.shape

(4757, 5)

In [88]:
df_invl.describe()

       invoice_line_id   invoice_id     track_id    unit_price  quantity
count      4757.000000  4757.000000  4757.000000  4.757000e+03    4757.0
mean       2379.000000   305.878915  1764.157452  9.900000e-01       1.0
std        1373.371945   177.748265  1004.400012  1.195836e-13       0.0
min           1.000000     1.000000     1.000000  9.900000e-01       1.0
25%        1190.000000   151.000000  1036.000000  9.900000e-01       1.0
50%        2379.000000   306.000000  1850.000000  9.900000e-01       1.0
75%        3568.000000   460.000000  2562.000000  9.900000e-01       1.0
max        4757.000000   614.000000  3500.000000  9.900000e-01       1.0

In [89]:
df_invl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4757 entries, 0 to 4756
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   invoice_line_id  4757 non-null   int64
 1   invoice_id       4757 non-null   int64
 2   track_id         4757 non-null   int64
 3   unit_price       4757 non-null   float64
 4   quantity         4757 non-null   int64
dtypes: float64(1), int64(4)
memory usage: 185.9 KB

### Data consistency checks

In [91]:
#Fnding null value 
df_invl.isnull().sum()

invoice_line_id    0
invoice_id         0
track_id           0
unit_price         0
quantity           0
dtype: int64

In [92]:
#Finding duplicate value
df_dup_invl = df_invl[df_invl.duplicated()]

In [93]:
df_dup_invl

Empty DataFrame
Columns: [invoice_line_id, invoice_id, track_id, unit_price, quantity]
Index: []

In [94]:
#Print "consistent" if no mixed types
for col in df_invl.columns.tolist():
  weird = (df_invl[[col]].applymap(type) != df_invl[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_invl[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

invoice_line_id  consistent
invoice_id  consistent
track_id  consistent
unit_price  consistent
quantity  consistent

### Data wrangling for track

In [95]:
df_tr.head()

,track_id,name,album_id,media_type_id,genre_id,composer,milliseconds,bytes,unit_price
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,NaN,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [96]:
df_tr.shape

(3503, 9)

In [97]:
df_tr.describe()

,track_id,album_id,media_type_id,genre_id,milliseconds,bytes,unit_price
count,3503.000000,3503.000000,3503.000000,3503.000000,3.503000e+03,3.503000e+03,3503.000000
mean,1752.000000,140.929489,1.208393,5.725378,3.935992e+05,3.351021e+07,1.050805
std,1011.373324,81.775395,0.580443,6.190204,5.350054e+05,1.053925e+08,0.239006
min,1.000000,1.000000,1.000000,1.000000,1.071000e+03,3.874700e+04,0.990000
25%,876.500000,70.500000,1.000000,1.000000,2.072810e+05,6.342566e+06,0.990000
50%,1752.000000,141.000000,1.000000,3.000000,2.556340e+05,8.107896e+06,0.990000
75%,2627.500000,212.000000,1.000000,7.000000,3.216450e+05,1.026679e+07,0.990000
max,3503.000000,347.000000,5.000000,25.000000,5.286953e+06,1.059546e+09,1.990000

In [98]:
df_tr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3503 entries, 0 to 3502
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   track_id       3503 non-null   int64
 1   name           3503 non-null   object
 2   album_id       3503 non-null   int64
 3   media_type_id  3503 non-null   int64
 4   genre_id       3503 non-null   int64
 5   composer       2525 non-null   object
 6   milliseconds   3503 non-null   int64
 7   bytes          3503 non-null   int64
 8   unit_price     3503 non-null   float64
dtypes: float64(1), int64(6), object(2)
memory usage: 246.4+ KB

### Data consistency checks

In [100]:
#Fnding null value 
df_tr.isnull().sum()

track_id           0
name               0
album_id           0
media_type_id      0
genre_id           0
composer         978
milliseconds       0
bytes              0
unit_price         0
dtype: int64

Found 978 missing values in composer columns

In [101]:
df_tr['composer'].value_counts()

Steve Harris                  80
U2                            44
Jagger/Richards               35
Billy Corgan                  31
Kurt Cobain                   26
                              ..
Stuart Zender                  1
Toby Smith/Wallis Buchanan     1
C. Cester/C. Muncey            1
N. Cester                      1
Philip Glass                   1
Name: composer, Length: 852, dtype: int64

In [104]:
#Check null values in product_name
df_nan = df_tr[df_tr['composer'].isnull() == True]

In [103]:
df_nan

,track_id,name,album_id,media_type_id,genre_id,composer,milliseconds,bytes,unit_price
1,2,Balls to the Wall,2,2,1,NaN,342562,5510424,0.99
62,63,Desafinado,8,1,2,NaN,185338,5990473,0.99
63,64,Garota De Ipanema,8,1,2,NaN,285048,9348428,0.99
64,65,Samba De Uma Nota SÛ (One Note Samba),8,1,2,NaN,137273,4535401,0.99
65,66,Por Causa De VocÍ,8,1,2,NaN,169900,5536496,0.99
...,...,...,...,...,...,...,...,...,...
3477,3478,Slowness,323,2,23,NaN,215386,3644793,0.99
3480,3481,"A Midsummer Night's Dream, Op.61 Incidental Mu...",326,2,24,NaN,387826,6497867,0.99
3495,3496,"…tude 1, In C Major - Preludio (Presto) - Liszt",340,4,24,NaN,51780,2229617,0.99
3496,3497,"Erlkonig, D.328",341,2,24,NaN,261849,4307907,0.99
3498,3499,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,343,2,24,NaN,286741,4718950,0.99

In [106]:
#check the size of data before removing
df_tr.shape

(3503, 9)

In [105]:
#Remove missing values from composer columns
df_tr_clean = df_tr[df_tr['composer'].isnull() == False]

In [107]:
#check the size of data after
df_tr_clean.shape

(2525, 9)

Data was removed successfully

In [108]:
#Print "consistent" if no mixed types
for col in df_tr.columns.tolist():
  weird = (df_tr[[col]].applymap(type) != df_tr[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_tr[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

track_id  consistent
name  consistent
album_id  consistent
media_type_id  consistent
genre_id  consistent
composer  mixed
milliseconds  consistent
bytes  consistent
unit_price  consistent

There is mixed type of data in composer columns

In [109]:
#change data type at composer columns
df_tr['composer'] = df_tr['composer'].astype(str)

In [110]:
#check consistency again
#Print "consistent" if no mixed types
for col in df_tr.columns.tolist():
  weird = (df_tr[[col]].applymap(type) != df_tr[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_tr[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

track_id  consistent
name  consistent
album_id  consistent
media_type_id  consistent
genre_id  consistent
composer  consistent
milliseconds  consistent
bytes  consistent
unit_price  consistent

No mixed type data at that column and all data are consistency now

In [ ]:
### Importing media_type, genre, album, artist, playlist_track, playlist

Fixing importing data problmes 
#data = pd.read_csv(filename, encoding= 'unicode_escape')

In [129]:
df_mt = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'media_type.csv'), index_col = False)
df_g = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'genre.csv'), index_col = False)
df_al = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'album.csv'), index_col = False, encoding= 'unicode_escape')
df_at = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'artist.csv'), index_col = False, encoding= 'unicode_escape')
df_plt = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'playlist_track.csv'), index_col = False,encoding= 'unicode_escape')
df_pl = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'playlist.csv'), index_col = False,encoding= 'unicode_escape')

### Data wrangling for media_type

df.head()
df.shape
df.describe()
df.info()

In [132]:
df_mt.head()

   media_type_id                         name
0              1              MPEG audio file
1              2     Protected AAC audio file
2              3  Protected MPEG-4 video file
3              4     Purchased AAC audio file
4              5               AAC audio file

In [133]:
df_mt.shape

(5, 2)

In [134]:
df_mt.describe()

       media_type_id
count       5.000000
mean        3.000000
std         1.581139
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         5.000000

In [135]:
df_mt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   media_type_id  5 non-null      int64
 1   name           5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

### Data consistency checks

#Fnding null value 
df.isnull().sum()
#Finding duplicate value
df_dup = df[df.duplicated()]
df_dup
#Print "consistent" if no mixed types
for col in df.columns.tolist():
  weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

In [137]:
#Fnding null value 
df_mt.isnull().sum()

media_type_id    0
name             0
dtype: int64

In [138]:
#Finding duplicate value
df_dup_mt = df_invl[df_invl.duplicated()]
df_dup_mt

Empty DataFrame
Columns: [invoice_line_id, invoice_id, track_id, unit_price, quantity]
Index: []

In [139]:
#Print "consistent" if no mixed types
for col in df_mt.columns.tolist():
  weird = (df_mt[[col]].applymap(type) != df_mt[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_mt[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

media_type_id  consistent
name  consistent

### Data wrangling for Genre

In [145]:
df_g.head()

   genre_id                name
0         1                Rock
1         2                Jazz
2         3               Metal
3         4  Alternative & Punk
4         5       Rock And Roll

In [142]:
df_g.shape

(25, 2)

In [143]:
df_g.describe()

        genre_id
count  25.000000
mean   13.000000
std     7.359801
min     1.000000
25%     7.000000
50%    13.000000
75%    19.000000
max    25.000000

In [144]:
df_g.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   genre_id  25 non-null     int64
 1   name      25 non-null     object
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

### Data consistency checks

In [146]:
#Fnding null value 
df_g.isnull().sum()

genre_id    0
name        0
dtype: int64

In [147]:
#Finding duplicate value
df_dup_g = df_g[df_g.duplicated()]
df_dup_g

Empty DataFrame
Columns: [genre_id, name]
Index: []

In [148]:
#Print "consistent" if no mixed types
for col in df_g.columns.tolist():
  weird = (df_g[[col]].applymap(type) != df_g[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_g[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

genre_id  consistent
name  consistent

### Data wrangling for Album

df_al.head()
df_al.shape
df_al.describe()
df_al.info()

# Data consistency checks

#Fnding null value 
df_al.isnull().sum()
#Finding duplicate value
df_dup_al = df_al[df_al.duplicated()]
df_dup_al
#Print "consistent" if no mixed types
for col in df_al.columns.tolist():
  weird = (df_al[[col]].applymap(type) != df_al[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_al[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

### Data wrangling for Artist

df_at.head()
df_at.shape
df_at.describe()
df_at.info()

# Data consistency checks

#Fnding null value 
df_at.isnull().sum()
#Finding duplicate value
df_dup_at = df_at[df_at.duplicated()]
df_dup_at
#Print "consistent" if no mixed types
for col in df_at.columns.tolist():
  weird = (df_at[[col]].applymap(type) != df_at[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_at[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

### Data wrangling for Playlist_Track

df_plt.head()
df_plt.shape
df_plt.describe()
df_plt.info()

# Data consistency checks

#Fnding null value 
df_plt.isnull().sum()
#Finding duplicate value
df_dup_plt = df_plt[df_plt.duplicated()]
df_dup_plt
#Print "consistent" if no mixed types
for col in df_plt.columns.tolist():
  weird = (df_plt[[col]].applymap(type) != df_plt[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_plt[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

### Data wrangling for Playlist

df_pl.head()
df_pl.shape
df_pl.describe()
df_pl.info()

In [ ]:
# Data consistency checks

#Fnding null value 
df_pl.isnull().sum()
#Finding duplicate value
df_dup_pl = df_pl[df_pl.duplicated()]
df_dup_pl
#Print "consistent" if no mixed types
for col in df_pl.columns.tolist():
  weird = (df_pl[[col]].applymap(type) != df_pl[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_pl[weird]) > 0:
    print (col, ' mixed')
  else: print(col, ' consistent')

In [ ]:
# Exporting Datas

In [150]:
df_emp.to_csv(os.path.join(path, '02 Data','Prepared Data', 'employee_cleaned.csv'))
df_cus.to_csv(os.path.join(path, '02 Data','Prepared Data', 'customer_cleaned.csv'))
df_inv.to_csv(os.path.join(path, '02 Data','Prepared Data', 'invoice_cleaned.csv'))
df_tr_clean.to_csv(os.path.join(path, '02 Data','Prepared Data', 'track_cleaned.csv'))
df_mt.to_csv(os.path.join(path, '02 Data','Prepared Data', 'media_type_cleaned.csv'))
df_g.to_csv(os.path.join(path, '02 Data','Prepared Data', 'genre_cleaned.csv'))
df_al.to_csv(os.path.join(path, '02 Data','Prepared Data', 'album_cleaned.csv'))
df_at.to_csv(os.path.join(path, '02 Data','Prepared Data', 'artist_cleaned.csv'))
df_plt.to_csv(os.path.join(path, '02 Data','Prepared Data', 'playlist_track_cleaned.csv'))
df_pl.to_csv(os.path.join(path, '02 Data','Prepared Data', 'playlist_cleaned.csv'))